// Алгоритм накопичення ми використовували у 4 завданні, тож код теж звідти
#define _CRT_SECURE_NO_WARNINGS
#include <iostream> // Бібліотека вводу/виводу
#include <Windows.h> // Бібліотека для української локалізації в консольному рядку
#define SIZE 5 // Оголошення змінної SIZE зі значенням 3, для вказання розміру масива


int main() {
    SetConsoleOutputCP(1251); // Встановлення української локалізації
    SetConsoleCP(1251); // Встановлення української локалізації

    int numbers[SIZE]; // Оголошення масиву із розміром SIZE або ж 5
    printf("Введіть п'ять цілих чисел: "); // Виведення тексту

    // Цикл для запису введених чисел у масив
    for (int i = 0; i < SIZE; ++i) {
        scanf("%d", &numbers[i]); // Запис i-того числа у масив
    }

    int sum = 0; // Оголошення змінної для суми

    // Цикл для знаходження суми чисел елемента
    for (int i = 0; i < SIZE; ++i) {
        sum += numbers[i];
    }

    printf("Сума всіх чисел масиву дорівнює: %d", sum); // Виведення результату

    return 0; // Закінчення програми
}
